[
  {
    "title": "Blogging With Monologue",
    "published": "2012-12-29T05:00:00.000Z",
    "body": "I recently decided my poor website needed more content to cheer it up a bit, so naturally I looked into blogging frameworks.Since this is a Ruby on Rails site, I first searched for blogging engines and quickly came across [Monologue](https://github.com/jipiboily/monologue). Like any rails engine should be - it was a breeze to integrate into my existing site and database. From first glance the default look & feel of Monologue is somewhat lacking - but that was exactly what I was looking for. Without a ton of existing styling, I was easily able to override the styling to match my existing site.\n\nFirst, I looked inside of [Monologue's source](https://github.com/jipiboily/monologue/tree/master/app/assets/stylesheets/monologue/blog) and found [custom.css](https://github.com/jipiboily/monologue/blob/master/app/assets/stylesheets/monologue/blog/custom.css). The great thing about rails engines are that any file can be overridden by the hosting application. All I had to do was create a custom.css file inside of `host_app\\app\\assets\\stylesheets\\monologue\\blog` - e.g. the same path and file name as monologue's custom.css except inside of my host application. Putting all my CSS into this custom.css file allowed me to easily inject my own CSS rules into Monologue.\n\n  Unfortunately my browser was still obeying any CSS rules inside of monologue.css over the rules I specified inside of my custom.css. While I could just override monologue.css as well, I didn't want to override more files then was needed. Plus, that would cause a lot of duplication between my application and the Monologue engine. Even more then the basic styling, I was going to have to override Monologue's layout to add a navbar to match my other pages. I created application.html.erb inside of `host_app\\app\\views\\layouts\\monologue` to match Monologue's [application.html.erb](https://github.com/jipiboily/monologue/blob/master/app/views/layouts/monologue/application.html.erb). I added my navbar, and I also added a CSS class of `.grayout` to the body. By adding this parent CSS class, it allowed me to easily force my styling in custom.css to override the styles of monologue.css.\n\n  A good example of overriding a style `.content article footer .social-tagline{ color: #181818; }`\n  could now be overridden by using\n  `.grayout .content article footer .social-tagline{ color: black; }`",
    "tags": ["tech", "rails", "html"]
  }
]
