[
  {
    "title": "Blogging With Monologue",
    "published": "2012-12-29T05:00:00.000Z",
    "body": "I recently decided my poor website needed more content to cheer it up a bit, so naturally I looked into blogging frameworks.Since this is a Ruby on Rails site, I first searched for blogging engines and quickly came across [Monologue](https://github.com/jipiboily/monologue). Like any rails engine should be - it was a breeze to integrate into my existing site and database. From first glance the default look & feel of Monologue is somewhat lacking - but that was exactly what I was looking for. Without a ton of existing styling, I was easily able to override the styling to match my existing site.\n\nFirst, I looked inside of [Monologue's source](https://github.com/jipiboily/monologue/tree/master/app/assets/stylesheets/monologue/blog) and found [custom.css](https://github.com/jipiboily/monologue/blob/master/app/assets/stylesheets/monologue/blog/custom.css). The great thing about rails engines are that any file can be overridden by the hosting application. All I had to do was create a custom.css file inside of `host_app\\app\\assets\\stylesheets\\monologue\\blog` - e.g. the same path and file name as monologue's custom.css except inside of my host application. Putting all my CSS into this custom.css file allowed me to easily inject my own CSS rules into Monologue.\n\n  Unfortunately my browser was still obeying any CSS rules inside of monologue.css over the rules I specified inside of my custom.css. While I could just override monologue.css as well, I didn't want to override more files then was needed. Plus, that would cause a lot of duplication between my application and the Monologue engine. Even more then the basic styling, I was going to have to override Monologue's layout to add a navbar to match my other pages. I created application.html.erb inside of `host_app\\app\\views\\layouts\\monologue` to match Monologue's [application.html.erb](https://github.com/jipiboily/monologue/blob/master/app/views/layouts/monologue/application.html.erb). I added my navbar, and I also added a CSS class of `.grayout` to the body. By adding this parent CSS class, it allowed me to easily force my styling in custom.css to override the styles of monologue.css.\n\n  A good example of overriding a style `.content article footer .social-tagline{ color: #181818; }`\n  could now be overridden by using\n  `.grayout .content article footer .social-tagline{ color: black; }`",
    "tags": ["tech", "rails", "html"]
  }, {
    "title": "TideSDK - Quick Cross-Platform Apps",
    "published": "2013-01-08T05:00:00.000Z",
    "body": "Last week I started working on a desktop client for the [Clipster Rails Engine](https://github.com/kwbock/clipster). My goals of the desktop client were to be quick, simple, and most of all cross-platform. I initially looked at [Qt’s C++ Framework](https://qt-project.org/). While I love using Qt for cross-platform development, the libraries are quite large and it seemed overkill for such a simple application. After searching around I stumbled across [TideSDK](http://tidesdk.multipart.net/docs/user-dev/generated/#). TideSDK is essentially a compilable website. It uses HTML5 & CSS for the GUI. For any back-end processing, it can use JavaScript, Ruby, Python, and even PHP.\n\nUsing TideSDK for Clipster Desktop was almost a no-brainer. Not only was it a simple cross-platform solution, but it allowed me to re-use many styling elements from the Clipster engine. Also the Clipser API supports JSON, so what better handling language could I ask for than JavaScript? My only initial concern going with TideSDK was user properties. To complete my goal of a quick application I needed to allow users to set default values for the host, title, and language. Looking through the API I came across exactly what I was looking for - [Ti.App.Properties](http://tidesdk.multipart.net/docs/user-dev/generated/#!/api/Ti.App.Properties). I also found some other cool features I might want in the future like an update manager, clipboard access, and database support.\n\n[Clipster Desktop](https://github.com/lightswitch05/clipster_desktop) is almost complete and will be ready for the next release of Clipster (v0.6.0), which adds the API feature being used. Since TideSDK was actually inspired (or part of?) by the cross-platform mobile SDK Titanium, I might even try a Clipster Mobile app for my next project!",
    "tags": ["tech", "html"]
  }, {
    "title": "Overclocking Raspberry Pi",
    "published": "2013-02-23T05:00:00.000Z",
    "body": "I'm trying to overclock my Raspberry Pi and ran into some issue, so I decided to document them incase anyone else has the same problem. I've been following [this tutorial](http://www.jeremymorgan.com/tutorials/raspberry-pi/how-to-overclock-raspberry-pi/) and noticed differences almost immediately. The first step is to get your CPU info by running `cat /proc/cpuinfo`. This is the first step that I noticed something different. In the tutorial BogoMIPS is 697.95, but for mine I have 464.48:\n\n <code>Processor       : ARMv6-compatible processor rev 7 (v6l)<br>  BogoMIPS        : 464.48<br>  Features        : swp half thumb fastmult vfp edsp java tls<br>  CPU implementer : 0x41<br>  CPU architecture: 7<br>  CPU variant     : 0x0<br>  CPU part        : 0xb76\n  CPU revision    : 7<br><br>  Hardware        : BCM2708<br>  Revision        : 000f<br>  Serial          : 0000000035dfc68c</code>\n\n  From everything I've been able to find, having a lower BogoMIPS doesn't really mean anything and is most likely caused by a newer firmware version. Running `cat /sys/devices/system/cpu/cpu0/cpufreq/scaling_cur_freq` still gives the expected 700000 Hz.\n\n  The next step is to run `vcgencmd get_config arm_freq`. This command, however, would fail with this error message `vcgencmd: error while loading shared libraries: libvcos.so: cannot open shared object file: No such file or directory`\n\n  With any library issue, the first step is to run ldd to see what dynamic librarys are needed and where they are being found. With vcgencmd I get:\n\n  <code>$ ldd /usr/bin/vcgencmd<br>     /usr/lib/arm-linux-gnueabihf/libcofi_rpi.so (0xb6fcb000)<br>     libvcos.so => not found<br>     libvchiq_arm.so => not found<br>     libpthread.so.0 => /lib/arm-linux-gnueabihf/libpthread.so.0 (0xb6fa7000)<br>     libdl.so.2 => /lib/arm-linux-gnueabihf/libdl.so.2 (0xb6f9c000)<br>     librt.so.1 => /lib/arm-linux-gnueabihf/librt.so.1 (0xb6f8d000)<br>     libc.so.6 => /lib/arm-linux-gnueabihf/libc.so.6 (0xb6e5e000)<br>     /lib/ld-linux-armhf.so.3 (0xb6fd7000)</code>\n\n  So, like the error message says, I'm missing libvcos.so. I'm also missing libvchiq_arm.so. But, after some looking around, it turns out I do have these. Not only do I have them, but according to `ldconfig -v -N` it is already in my LD Library path too! After some googling around I found some other people have the same issue with those libraries. The solution requires updating your firmware. The easest way to do that is to install [rpi-update](https://github.com/Hexxeh/rpi-update). After updating the firmware I was able to finish the rest of the tutorial without any issue. As a side note, I chose to use `raspi-config` (near the bottom of the tutorial) to overclock my pi.",
    "tags": ["tech", "linux", "raspberry-pi"]
  }, {
    "title": "Fetch all records updated since...",
    "published": "2014-07-14T05:00:00.000Z",
    "body": "Recently I needed my APIs to filter index responses with records updated since a particular date and time. This requirement was not just for a single API, but for almost all my index queries. To add to the requirements, the new `updated_since` param is optional. Rather than adding a scope to each model to handle this optional param, I made use of the new `ActiveSupport::Concern` class and included it in the relevant models. By moving the `updated_since` scope to a module, I not only prevented code duplication, but was able to add logging without bloating my models.\n\n  Example Usage:\n\n  `@customers = Customer.updated_since(params[:updated_since])`\n\nComplete `UpdatedSince` module can be seen below, or take a look at the [Gist](https://gist.github.com/lightswitch05/89fc488363a406c7fe6f)\n\n<code>module UpdatedSince<br>  extend ActiveSupport::Concern<br><br>  module ClassMethods<br>    def updated_since(time)<br>      if parsed_time = convert_time(time)<br>        where('updated_at >= ?', parsed_time)<br>      else<br>        all<br>      end<br>    end<br><br>    private<br><br>      def convert_time(time)<br>        Time.zone.parse(time) unless time.blank?<br>      rescue ArgumentError<br>        self.logger.warn 'Invalid updated_since time: <#{time}>'<br>        nil<br>      end<br>  end<br>end</code>\n\nUpdate: Thanks to [didnotseethatcoming](http://www.reddit.com/r/rails/comments/2ap4sj/my_first_use_of_activesupportconcern/cixfc97) for the code review",
    "tags": ["tech", "rails"]
  }
]
